joristork/robots/jobot_in_c/microchip_extras/h/p18f84j90.h
/*-------------------------------------------------------------------------
 * MPLAB-Cxx  PIC18F84J90 processor header
 *
 * (c) Copyright 1999-2010 Microchip Technology, All rights reserved
 *-------------------------------------------------------------------------*/

#ifndef __18F84J90_H
#define __18F84J90_H

extern volatile near unsigned char       RCSTA2;
extern volatile near union {
  struct {
    unsigned RX9D:1;
    unsigned OERR:1;
    unsigned FERR:1;
    unsigned ADDEN:1;
    unsigned CREN:1;
    unsigned SREN:1;
    unsigned RX9:1;
    unsigned SPEN:1;
  };
  struct {
    unsigned RCD8:1;
    unsigned :5;
    unsigned RC9:1;
  };
  struct {
    unsigned :6;
    unsigned NOT_RC8:1;
  };
  struct {
    unsigned :6;
    unsigned RC8_9:1;
  };
  struct {
    unsigned RX9D2:1;
    unsigned OERR2:1;
    unsigned FERR2:1;
    unsigned ADDEN2:1;
    unsigned CREN2:1;
    unsigned SREN2:1;
    unsigned RX92:1;
    unsigned SPEN2:1;
  };
} RCSTA2bits;
extern volatile near unsigned char       TXSTA2;
extern volatile near union {
  struct {
    unsigned TX9D:1;
    unsigned TRMT:1;
    unsigned BRGH:1;
    unsigned :1;
    unsigned SYNC:1;
    unsigned TXEN:1;
    unsigned TX9:1;
    unsigned CSRC:1;
  };
  struct {
    unsigned TXD8:1;
    unsigned :5;
    unsigned TX8_9:1;
  };
  struct {
    unsigned :6;
    unsigned NOT_TX8:1;
  };
  struct {
    unsigned TX9D2:1;
    unsigned TRMT2:1;
    unsigned BRGH2:1;
    unsigned SENDB2:1;
    unsigned SYNC2:1;
    unsigned TXEN2:1;
    unsigned TX92:1;
    unsigned CSRC2:1;
  };
} TXSTA2bits;
extern volatile near unsigned char       TXREG2;
extern volatile near unsigned char       RCREG2;
extern volatile near unsigned char       SPBRG2;
extern volatile near unsigned char       CCP2CON;
extern volatile near union {
  struct {
    unsigned CCP2M:4;
    unsigned DC2B:2;
  };
  struct {
    unsigned CCP2M0:1;
    unsigned CCP2M1:1;
    unsigned CCP2M2:1;
    unsigned CCP2M3:1;
    unsigned DC2B0:1;
    unsigned DC2B1:1;
  };
  struct {
    unsigned :4;
    unsigned DCCP2Y:1;
    unsigned DCCP2X:1;
  };
} CCP2CONbits;
extern volatile near unsigned            CCPR2;
extern volatile near unsigned char       CCPR2L;
extern volatile near unsigned char       CCPR2H;
extern volatile near unsigned char       CCP1CON;
extern volatile near union {
  struct {
    unsigned CCP1M:4;
    unsigned DC1B:2;
  };
  struct {
    unsigned CCP1M0:1;
    unsigned CCP1M1:1;
    unsigned CCP1M2:1;
    unsigned CCP1M3:1;
    unsigned DC1B0:1;
    unsigned DC1B1:1;
  };
  struct {
    unsigned :4;
    unsigned DCCP1Y:1;
    unsigned DCCP1X:1;
  };
} CCP1CONbits;
extern volatile near unsigned            CCPR1;
extern volatile near unsigned char       CCPR1L;
extern volatile near unsigned char       CCPR1H;
extern volatile near unsigned char       LCDDATA5;
extern volatile near union {
  struct {
    unsigned LCDDATA5:8;
  };
  struct {
    unsigned S40C0:1;
    unsigned S41C0:1;
    unsigned S42C0:1;
    unsigned S43C0:1;
    unsigned S44C0:1;
    unsigned S45C0:1;
    unsigned S46C0:1;
    unsigned S47C0:1;
  };
  struct {
    unsigned SEG40COM0:1;
    unsigned SEG41COM0:1;
    unsigned SEG42COM0:1;
    unsigned SEG43COM0:1;
    unsigned SEG44COM0:1;
    unsigned SEG45COM0:1;
    unsigned SEG46COM0:1;
    unsigned SEG47COM0:1;
  };
} LCDDATA5bits;
extern volatile near unsigned char       LCDDATA6;
extern volatile near union {
  struct {
    unsigned LCDDATA6:8;
  };
  struct {
    unsigned S00C1:1;
    unsigned S01C1:1;
    unsigned S02C1:1;
    unsigned S03C1:1;
    unsigned S04C1:1;
    unsigned S05C1:1;
    unsigned S06C1:1;
    unsigned S07C1:1;
  };
  struct {
    unsigned SEG0COM1:1;
    unsigned SEG1COM1:1;
    unsigned SEG2COM1:1;
    unsigned SEG3COM1:1;
    unsigned SEG4COM1:1;
    unsigned SEG5COM1:1;
    unsigned SEG6COM1:1;
    unsigned SEG7COM1:1;
  };
  struct {
    unsigned S0C1:1;
    unsigned S1C1:1;
    unsigned S2C1:1;
    unsigned S3C1:1;
    unsigned S4C1:1;
    unsigned S5C1:1;
    unsigned S6C1:1;
    unsigned S7C1:1;
  };
} LCDDATA6bits;
extern volatile near unsigned char       LCDDATA7;
extern volatile near union {
  struct {
    unsigned LCDDATA7:8;
  };
  struct {
    unsigned S8C1:1;
    unsigned S9C1:1;
    unsigned S10C1:1;
    unsigned S11C1:1;
    unsigned S12C1:1;
    unsigned S13C1:1;
    unsigned S14C1:1;
    unsigned S15C1:1;
  };
  struct {
    unsigned SEG8COM1:1;
    unsigned SEG9COM1:1;
    unsigned SEG10COM1:1;
    unsigned SEG11COM1:1;
    unsigned SEG12COM1:1;
    unsigned SEG13COM1:1;
    unsigned SEG14COM1:1;
    unsigned SEG15COM1:1;
  };
  struct {
    unsigned S08C1:1;
    unsigned S09C1:1;
  };
} LCDDATA7bits;
extern volatile near unsigned char       LCDDATA8;
extern volatile near union {
  struct {
    unsigned LCDDATA8:8;
  };
  struct {
    unsigned S16C1:1;
    unsigned S17C1:1;
    unsigned S18C1:1;
    unsigned S19C1:1;
    unsigned S20C1:1;
    unsigned S21C1:1;
    unsigned S22C1:1;
    unsigned S23C1:1;
  };
  struct {
    unsigned SEG16COM1:1;
    unsigned SEG17COM1:1;
    unsigned SEG18COM1:1;
    unsigned SEG19COM1:1;
    unsigned SEG20COM1:1;
    unsigned SEG21COM1:1;
    unsigned SEG22COM1:1;
    unsigned SEG23COM1:1;
  };
} LCDDATA8bits;
extern volatile near unsigned char       LCDDATA9;
extern volatile near union {
  struct {
    unsigned LCDDATA9:8;
  };
  struct {
    unsigned S24C1:1;
    unsigned S25C1:1;
    unsigned S26C1:1;
    unsigned S27C1:1;
    unsigned S28C1:1;
    unsigned S29C1:1;
    unsigned S30C1:1;
    unsigned S31C1:1;
  };
  struct {
    unsigned SEG24COM1:1;
    unsigned SEG25COM1:1;
    unsigned SEG26COM1:1;
    unsigned SEG27COM1:1;
    unsigned SEG28COM1:1;
    unsigned SEG29COM1:1;
    unsigned SEG30COM1:1;
    unsigned SEG31COM1:1;
  };
} LCDDATA9bits;
extern volatile near unsigned char       LCDDATA10;
extern volatile near union {
  struct {
    unsigned LCDDATA10:8;
  };
  struct {
    unsigned S32C1:1;
    unsigned S33C1:1;
    unsigned S34C1:1;
    unsigned S35C1:1;
    unsigned S36C1:1;
    unsigned S37C1:1;
    unsigned S38C1:1;
    unsigned S39C1:1;
  };
  struct {
    unsigned SEG32COM1:1;
    unsigned SEG33COM1:1;
    unsigned SEG34COM1:1;
    unsigned SEG35COM1:1;
    unsigned SEG36COM1:1;
    unsigned SEG37COM1:1;
    unsigned SEG38COM1:1;
    unsigned SEG39COM1:1;
  };
} LCDDATA10bits;
